Revit 2024 API
Color.Blue Property
Get the blue channel of the color. Setting a channel is obsolete in Autodesk Revit 2013. Please create a new color instead.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public byte Blue { get; set; }
Visual Basic
Public Property Blue As Byte
	Get
	Set
Visual C++
public:
property unsigned char Blue {
	unsigned char get ();
	void set (unsigned char value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException | When getting the value: the color is invalid or uninitialized.
See Also
Color Class
Autodesk.Revit.DB Namespace